tutorials/mesh/parallel/filter/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Create mesh
runApplication blockMesh

# Restore 0/ from 0.org/
restore0Dir

# Create sets
runApplication topoSet

# Create baffles and fields
runApplication createBaffles -overwrite

runApplication $(getApplication)

#- RedistributePar to do decomposition
runParallel redistributePar -decompose -cellDist

#- Continue running for a bit more
runParallel -s parallel $application

#- Reconstruct all times
runParallel -s 1 redistributePar -reconstruct


# ----------------------------------------------------------------- end-of-file
